{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Dense", "config": {"name": "dense", "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "units": 40, "kernel_regularizer": null, "trainable": true, "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "batch_input_shape": [null, 40]}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_1", "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "units": 20, "kernel_regularizer": null, "trainable": true, "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "noise_shape": null, "rate": 0.5, "dtype": "float32", "seed": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_2", "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "units": 10, "kernel_regularizer": null, "trainable": true, "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "rate": 0.5, "dtype": "float32", "seed": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_3", "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "units": 1, "kernel_regularizer": null, "trainable": true, "activation": "sigmoid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}]}}, "training_config": {"weighted_metrics": null, "metrics": ["accuracy"], "optimizer_config": {"class_name": "Adam", "config": {"decay": 0.0, "beta_2": 0.9990000128746033, "name": "Adam", "amsgrad": false, "beta_1": 0.8999999761581421, "epsilon": 1e-07, "learning_rate": 0.0010000000474974513}}, "loss": "binary_crossentropy", "loss_weights": null, "sample_weight_mode": null}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense/kernel", "shape": [40, 40], "dtype": "float32"}, {"name": "dense/bias", "shape": [40], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [40, 20], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [20], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [20, 10], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [10], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [10, 1], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [1], "dtype": "float32"}]}]}